ci4/app/Controllers/BookController.php

    public function index() {
        $db = \Config\Database::connect();
        $books = $db->table('books b')
            ->select('b.*, g.name as genre_name')
            ->join('genres g', 'g.id = b.genre_id', 'left')
            ->get()->getResultArray();
---
SELECT `b`.*, `g`.`name` as `genre_name`
FROM `books` `b`
LEFT JOIN `genres` `g` ON `g`.`id` = `b`.`genre_id`