ci4/app/Controllers/BorrowingController.php

    public function index() {
        $db = \Config\Database::connect();
        $data = $db->table('borrowings br')
            ->select('br.*, m.name as member_name, b.title as book_title')
            ->join('members m', 'm.id = br.member_id', 'left')
            ->join('books b', 'b.id = br.book_id', 'left')
            ->get()->getResultArray();
---
SELECT `br`.*, `m`.`name` as `member_name`, `b`.`title` as `book_title`
FROM `borrowings` `br`
LEFT JOIN `members` `m` ON `m`.`id` = `br`.`member_id`
LEFT JOIN `books` `b` ON `b`.`id` = `br`.`book_id`