ci4/app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null) {
        $authHeader = $request->getHeaderLine('Authorization');
        if (!$authHeader || !str_starts_with($authHeader, 'Bearer ')) {
            return response()->setStatusCode(401)->setJSON(['message' => 'Unauthorized']);
        }
        $token = substr($authHeader, 7);
        $db = \Config\Database::connect();
        $user = $db->table('users')->where('token', $token)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `token` = 'df202afb3ee033afa8adea882eafea1fbbc17eeb4d02b9014a66e041aaef094a'